VPro/src/DataProcessors/InteractiveDataExchangeAssistant/InteractiveDataExchangeAssistant.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>InteractiveDataExchangeAssistant</name>
  <attributes>
    <name>ExchangeMessageTransportKind</name>
    <type>
      <types>EnumRef.ExchangeMessagesTransportKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>TemporaryExchangeMessagesDirectoryName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangePlanName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeMessageFileName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InfobaseNode</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>StatisticsInformation</name>
    <attributes>
      <name>DataSuccessfullyImported</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverTableName</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>PictureIndex</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UsePreview</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <comment>Key of the row for linking with the value tree on form</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectsCountInSource</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectsCountInReceiver</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnmappedObjectsCount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NumberOfObjectsMapped</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OneToMany</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchFields</name>
      <comment>Default search fields</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TableFields</name>
      <comment>Table fields, for which properties conversion rules are defined</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectsMappingPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SynchronizeByID</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceTypeAsString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectTypeAsString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ReceiverTypeAsString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>IsClassifier</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ThisIsObjectDeletion</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

VPro/src/Enums/ActionsAtExchange/ActionsAtExchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ActionsAtExchange</name>
  <enumValues>
    <name>DataImport</name>
  </enumValues>
  <enumValues>
    <name>DataExport</name>
  </enumValues>
</mdclass:Enum>

VPro/src/DataProcessors/InteractiveDataExchangeAssistant/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProgramInterface

// For internal use.
//
Procedure RunAutomaticDataMapping(Parameters, TemporaryStorageAddress) Export
	
	PutToTempStorage(
		ResultOfAutomaticMappingData(Parameters.InfobaseNode, Parameters.ExchangeMessageFileName, Parameters.TemporaryExchangeMessagesDirectoryName,
		Parameters.CheckVersionDifference), TemporaryStorageAddress
	);
		
EndProcedure

// For internal use.
//
Function ResultOfAutomaticMappingData(Val Correspondent, Val ExchangeMessageFileName, Val TemporaryExchangeMessagesDirectoryName, CheckVersionDifference) Export
	
	// Execute automatic data mapping received from correspondent.
	// Get mapping statistics.
	
	SetPrivilegedMode(True);
	
	DataExchangeServer.InitializeVersionDifferencesCheckParameters(CheckVersionDifference);
	
	InteractiveDataExchangeAssistant = DataProcessors.InteractiveDataExchangeAssistant.Create();
	InteractiveDataExchangeAssistant.InfobaseNode = Correspondent;
	InteractiveDataExchangeAssistant.ExchangeMessageFileName = ExchangeMessageFileName;
	InteractiveDataExchangeAssistant.TemporaryExchangeMessagesDirectoryName = TemporaryExchangeMessagesDirectoryName;
	InteractiveDataExchangeAssistant.ExchangePlanName = DataExchangeReUse.GetExchangePlanName(Correspondent);
	InteractiveDataExchangeAssistant.ExchangeMessageTransportKind = Undefined;
	
	// Execute exchange message analysis.
	Cancel = False;
	InteractiveDataExchangeAssistant.RunExchangeMessageAnalysis(Cancel);
	If Cancel Then
		If SessionParameters.VersionsDifferenceErrorOnReceivingData.IsError Then
			Return SessionParameters.VersionsDifferenceErrorOnReceivingData;
		Else
			Raise StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en='Cannot import data from ""%1"" (data analysis step).';ru='Не удалось загрузить данные из ""%1"" (этап анализа данных).';vi='Không thể kết nhập dữ liệu từ ""%1"" (giai đoạn phân tích dữ liệu).'"),
				String(Correspondent));
		EndIf;
	EndIf;
	
	// Execute automatic mapping and receive mapping statistics.
	Cancel = False;
	InteractiveDataExchangeAssistant.RunAutomaticMappingByDefaultAndGetMappingStats(Cancel);
	If Cancel Then
		Raise StringFunctionsClientServer.SubstituteParametersInString(
			NStr("en='Cannot import data from ""%1"" (automatic data mapping step).';ru='Не удалось загрузить данные из ""%1"" (этап автоматического сопоставления данных).';vi='Không thể kết nhập dữ liệu từ ""%1"" (giai đoạn tự động so sánh dữ liệu).'"),
			String(Correspondent));
	EndIf;
	
	TableOfInformationStatistics = InteractiveDataExchangeAssistant.TableOfInformationStatistics();
	
	Result = New Structure;
	Result.Insert("StatisticsInformation", TableOfInformationStatistics);
	Result.Insert("AllDataMapped", AllDataMapped(TableOfInformationStatistics));
	Result.Insert("StatisticsIsEmpty", TableOfInformationStatistics.Count() = 0);
	
	Return Result;
EndFunction

// For an internal use.
//
Procedure ExecuteDataImport(Parameters, TemporaryStorageAddress) Export
	
	DataExchangeServer.ExecuteDataExchangeForInfobaseNodeOverFileOrString(
		Parameters.InfobaseNode,
		Parameters.ExchangeMessageFileName,
		Enums.ActionsAtExchange.DataImport
	);
EndProcedure

// For an internal use.
//
Function AllDataMapped(StatisticsInformation) Export
	
	Return (StatisticsInformation.FindRows(New Structure("PictureIndex", 1)).Count() = 0);
	
EndFunction

#EndRegion

#EndIf
